---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.ServerGUID
source: html/94277b06-9ddc-a15a-032e-984176ddbd44.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData.ServerGUID Property

The GUID of the duct fitting or duct accessory.

## Syntax (C#)
```csharp
public Guid ServerGUID { get; }
```